# Задание:
#
# Реализовать приложение, которое будет вполнять следующую последовательность действий:
# 1. Считать изображение по указанному пользователем пути,
# 2. Выполнить необходимое по варианту преобразование над ним с указанными пользователем параметрами,
# 3. Продемонстрировать исходное, преобразованное изображение и их гистрограммы,
# 4. Сохранить преобразованное изображение по указанному пользователем пути.
#
# Входные параметры:
# 1. Путь к исходному изображению,
# 2. Путь, по которому будет сохранено результирующе изображение,
# 3. Параметры, необходимые для выполнения заданного преобразования.
#
# Вариант №4: Выделение контуров
# Дополнительные параметры: Параметр, отвечающий за выбор алгоритма
#

